# Question 2

`Write a query to retrieve the top 5 customers who have spent the most amount in the first 9 months of year 2012.`

(Hint: use the HAVING clause to filter out customers who have only made one purchase)

## Expected Output
| CustomerId | CustomerFullName   | PurchaseCount | TotalSpend | InvoiceId | FirstPurchaseDate |
| ---       | ---                | ---           | ---        | ---       | ---               |
| 26        | Richard Cunningham | 14            | 23.86      | 299       | 2012-08-05       |
| 55        | Mark Taylor        | 14            | 13.86      | 250       | 2012-01-01       |
| 34        | João Fernandes     | 14            | 13.86      | 257       | 2012-02-01       |
| 13        | Fernanda Ramos     | 14            | 13.86      | 264       | 2012-03-03       |
| 51        | Joakim Johansson   | 14            | 13.86      | 271       | 2012-04-03       |

In [1]:
%run ../utils/setup_notebook.ipynb

In [2]:
%%sql 

SELECT *
FROM customers 
LIMIT 1

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3)]

In [3]:
%%sql 

SELECT *
FROM invoices
LIMIT 1

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98)]

In [4]:
%%sql 

SELECT *
FROM invoice_items
LIMIT 1

[(1, 1, 2, 0.99, 1)]

In [5]:
%%sql 

SELECT ROUND(SUM(it.UnitPrice * it.Quantity),2) as TotalInvoiceAmount
FROM invoice_items it 
JOIN invoices i ON i.InvoiceId = it.InvoiceId
GROUP BY i.InvoiceId
ORDER BY TotalInvoiceAmount DESC
LIMIT 5

[(25.86,), (23.86,), (21.86,), (21.86,), (18.86,)]

In [6]:
%%sql 

SELECT i.Total as TotalInvoiceAmount
FROM invoice_items it 
JOIN invoices i ON i.InvoiceId = it.InvoiceId
GROUP BY i.InvoiceId
ORDER BY TotalInvoiceAmount DESC
LIMIT 5

[(25.86,), (23.86,), (21.86,), (21.86,), (18.86,)]

In [7]:
%%sql 

SELECT c.CustomerId, CONCAT(c.FirstName, ' ',c.LastName) AS CustomerFullName,
COUNT(i.InvoiceId) AS PurchaseCount,
ROUND(SUM(it.UnitPrice * it.Quantity),2) as TotalSpend,
i.InvoiceId,
DATE_FORMAT(MIN(i.InvoiceDate), '%Y-%m-%d') AS FirstPurchaseDate
FROM invoice_items it
JOIN invoices i ON i.InvoiceId = it.InvoiceId
JOIN customers c ON c.CustomerId = i.CustomerId
WHERE i.InvoiceDate BETWEEN '2012-01-01' AND '2012-09-01'
GROUP BY i.InvoiceId
HAVING PurchaseCount > 10
ORDER BY TotalSpend DESC
LIMIT 5

[(26, 'Richard Cunningham', 14, 23.86, 299, '2012-08-05'),
 (55, 'Mark Taylor', 14, 13.86, 250, '2012-01-01'),
 (34, 'João Fernandes', 14, 13.86, 257, '2012-02-01'),
 (13, 'Fernanda Ramos', 14, 13.86, 264, '2012-03-03'),
 (51, 'Joakim Johansson', 14, 13.86, 271, '2012-04-03')]